stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    gatt_client_app.c
  * @author  MCD Application Team
  * @brief   GATT Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"
#include "ble.h"
#include "gatt_client_app.h"
#include "stm32_seq.h"
#include "app_ble.h"
#include "ble_evt.h"
#include "otp_client.h"
#include "nvm_db.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "esl_profile_ap.h"
#include "time_ref.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */
#define ECP_TIMEOUT_MS         (30 * 1000)  // 30 seconds
/* USER CODE END PTD */

typedef enum
{
  NOTIFICATION_INFO_RECEIVED_EVT,
  /* USER CODE BEGIN GATT_CLIENT_APP_Opcode_t */
  ESL_NOTIFICATION_INFO_RECEIVED_EVT
  /* USER CODE END GATT_CLIENT_APP_Opcode_t */
}GATT_CLIENT_APP_Opcode_t;

typedef struct
{
  uint8_t *p_Payload;
  uint8_t length;
}GATT_CLIENT_APP_Data_t;

typedef struct
{
  GATT_CLIENT_APP_Opcode_t Client_Evt_Opcode;
  GATT_CLIENT_APP_Data_t   DataTransfered;
}GATT_CLIENT_APP_Notification_evt_t;

typedef struct
{
  GATT_CLIENT_APP_State_t state;

  uint16_t connHdl;

  uint16_t ALLServiceStartHdl;
  uint16_t ALLServiceEndHdl;

  uint16_t GAPServiceStartHdl;
  uint16_t GAPServiceEndHdl;

  uint16_t GATTServiceStartHdl;
  uint16_t GATTServiceEndHdl;

  uint16_t ServiceChangedCharHdl;
  uint16_t ServiceChangedCharValueHdl;
  uint16_t ServiceChangedCharDescHdl;

  /* USER CODE BEGIN BleClientAppContext_t */
  /* Handles of ESL service */
  uint16_t ESLServiceHdl;
  uint16_t ESLServiceEndHdl;

  /* handles of the Tx characteristic - Write To Server */
  /* Handles of ESL Address characteristic */
  uint16_t ESLAddressCharHdl;
  uint16_t ESLAddressValueHdl;
  
  /* Handles of AP Sync Material characteristic */
  uint16_t APSyncKeyMaterialCharHdl;
  uint16_t APSyncKeyMaterialValueHdl;
  
  /* Handles of ESL Resp Key Material characteristic */
  uint16_t ESLRespKeyMaterialCharHdl;
  uint16_t ESLRespKeyMaterialValueHdl;
  
  /* Handles of ESL Current Absolute Time characteristic */
  uint16_t ESLCurrAbsTimeCharHdl;
  uint16_t ESLCurrAbsTimeValueHdl;
  
  /* handles of the Rx characteristic - Notification From Server */  
  /* Handles of ESL Control Point characteristic */
  uint16_t ESLControlPointCharHdl;
  uint16_t ESLControlPointValueHdl;
  uint16_t ESLControlPointCCCDHdl;
    
  /* Handles of ESL Display Information characteristic */
  uint16_t ESLDisplayInfoCharHdl;
  uint16_t ESLDisplayInfoValueHdl;
  
  /* Handles of ESL Image Information characteristic */
  uint16_t ESLImageInfoCharHdl;
  uint16_t ESLImageInfoValueHdl;

  /* Handles of ESL LED Information characteristic */
  uint16_t ESLSensorInfoCharHdl;
  uint16_t ESLSensorInfoValueHdl;
  
  /* Handles of ESL LED Information characteristic */
  uint16_t ESLLedInfoCharHdl;
  uint16_t ESLLedInfoValueHdl;
  
  OTSHandleContext_t OTSHandles;
  
  uint16_t DISPNPIdCharHdl;
  uint16_t DISPNPIdValueHdl;
  
  uint8_t gatt_error_code;
  
  /* ESL Control Point (ECP) timeout timerID*/
  VTIMER_HandleType ECP_timer_Id;    
  
  uint16_t att_mtu;
  uint16_t read_char_len;
  uint8_t read_char[512];
  uint16_t read_char_offset;
  bool b_ECP_failed; 
/* USER CODE END BleClientAppContext_t */

}BleClientAppContext_t;

typedef enum
{
  PROC_GATT_DISC_ALL_PRIMARY_SERVICES,
  PROC_GATT_DISC_ALL_CHARS,
  PROC_GATT_DISC_ALL_DESCS,
  PROC_GATT_ENABLE_ALL_NOTIFICATIONS,
  /* USER CODE BEGIN ProcGattId_t*/

  /* USER CODE END ProcGattId_t */
}ProcGattId_t;

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

static BleClientAppContext_t a_ClientContext[CFG_BLE_NUM_CLIENT_CONTEXTS];

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */
extern ESL_AP_context_t ESL_AP_Context;
/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/

static BLEEVT_EvtAckStatus_t EventHandler(aci_blecore_event *p_evt);
static void gatt_parse_services(aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt);
static void gatt_parse_services_by_UUID(aci_att_clt_find_by_type_value_resp_event_rp0 *p_evt);
static void gatt_parse_chars(aci_att_clt_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_descs(aci_att_clt_find_info_resp_event_rp0 *p_evt);
static void gatt_parse_notification(aci_gatt_clt_notification_event_rp0 *p_evt);
static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif);
static void client_discover_all(void);
static void gatt_cmd_resp_release(void);
static void gatt_cmd_resp_wait(void);
static uint8_t gatt_procedure(uint8_t index, ProcGattId_t GattProcId);
/* USER CODE BEGIN PFP */
static void context_init(uint8_t index);
static void ECPTimeout(void *arg);
static void print_Info_Char(void);
static uint8_t ReadLongChar(uint16_t ValueHdl, uint16_t Offset);
static void set_ECP_Failed(bool bValue);
static uint8_t ReadInfoChar(uint16_t ValueHdl);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GATT_CLIENT_APP_Init(void)
{
  int ret;

