stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
  /* USER CODE BEGIN GATT_CLIENT_APP_Init_1 */

  /* USER CODE END GATT_CLIENT_APP_Init_1 */

  for(uint8_t index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    a_ClientContext[index].connHdl = 0xFFFF;
    a_ClientContext[index].state = GATT_CLIENT_APP_DISCONNECTED;
  }

  /**
   *  Register the event handler to the BLE controller
   */
  ret = BLEEVT_RegisterGattEvtHandler(EventHandler);
  if (ret != 0)
  {
    Error_Handler();
  }
  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_all);
  
  context_init(0);
  
  TIMEREF_SetAbsoluteTime(0);
  
  OTP_CLIENT_Init();
  
  /* USER CODE END GATT_CLIENT_APP_Init_2 */
  return;
}

static void context_init(uint8_t index)
{                                   
  memset(&a_ClientContext[index], 0, sizeof(BleClientAppContext_t));
  a_ClientContext[index].state = GATT_CLIENT_APP_DISCONNECTED;
  a_ClientContext[index].connHdl = 0xFFFF;
  
  /* When the AP writes to the ECP, the AP shall start a timer with the value 
     set to the ESL Control Point Timeout period (30 seconds). If the timer 
     expires, then the ECP procedure shall be considered to have failed. */
  a_ClientContext[index].ECP_timer_Id.callback = ECPTimeout;
}

void GATT_CLIENT_APP_Notification(GATT_CLIENT_APP_ConnHandle_Notif_evt_t *p_Notif)
{
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_1 */

  /* USER CODE END GATT_CLIENT_APP_Notification_1 */
  switch(p_Notif->ConnOpcode)
  {
    /* USER CODE BEGIN ConnOpcode */

    /* USER CODE END ConnOpcode */

    case PEER_CONN_HANDLE_EVT :
      {
        uint8_t index;

        for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
        {
          if(a_ClientContext[index].state == GATT_CLIENT_APP_DISCONNECTED)
          {
            a_ClientContext[index].connHdl = p_Notif->ConnHdl;
            a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
            /* USER CODE BEGIN PEER_CONN_HANDLE_EVT_1 */
            context_init(index);
      
            set_ECP_Failed(false);
      
            a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;
            a_ClientContext[index].connHdl = p_Notif->ConnHdl;      
            a_ClientContext[index].att_mtu = 23;
            OTP_CLIENT_ConnectionComplete(&a_ClientContext[index].OTSHandles, a_ClientContext[index].connHdl);
            /* USER CODE END PEER_CONN_HANDLE_EVT_1 */

            break;
          }
        }
        if(index == CFG_BLE_NUM_CLIENT_CONTEXTS)
        {
          APP_DBG_MSG("Error: reached maximum number of connected servers!\n");
          aci_gap_terminate(p_Notif->ConnHdl, BLE_ERROR_TERMINATED_REMOTE_USER);
        }

        /* USER CODE BEGIN PEER_CONN_HANDLE_EVT */
        
        /* USER CODE END PEER_CONN_HANDLE_EVT */
      }
      break;

    case PEER_DISCON_HANDLE_EVT :
      {
        for(uint8_t index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
        {
          if(a_ClientContext[index].connHdl == p_Notif->ConnHdl)
          {
            /* Set all handles to 0. */
            memset(&a_ClientContext[index], 0, sizeof(BleClientAppContext_t));
            a_ClientContext[index].connHdl = 0xFFFF;
            a_ClientContext[index].state = GATT_CLIENT_APP_DISCONNECTED;

            /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT_1 */
            HAL_RADIO_TIMER_StopVirtualTimer(&a_ClientContext[index].ECP_timer_Id);
            /* USER CODE END PEER_DISCON_HANDLE_EVT_1 */

            break;
          }
        }
        /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT */
        
        /* USER CODE END PEER_DISCON_HANDLE_EVT */
      }
      break;

    default:
      /* USER CODE BEGIN ConnOpcode_Default */

      /* USER CODE END ConnOpcode_Default */
      break;
  }
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_2 */

  /* USER CODE END GATT_CLIENT_APP_Notification_2 */
  return;
}

void GATT_CLIENT_APP_DiscoverServices(uint16_t connection_handle)
{
  for(uint8_t index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if(a_ClientContext[index].connHdl == connection_handle)
    {
      a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_SERVICES;

      /* USER CODE BEGIN GATT_CLIENT_APP_Discover_services */

      /* USER CODE END GATT_CLIENT_APP_Discover_services */

      UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);

      break;
    }
  }

  return;
}

uint8_t gatt_procedure(uint8_t index, ProcGattId_t GattProcId)
{
  tBleStatus result = BLE_STATUS_SUCCESS;
  uint8_t status;

  if (index >= CFG_BLE_NUM_CLIENT_CONTEXTS)
  {
    status = 1;
  }
  else
  {
    status = 0;
    switch (GattProcId)
    {
      case PROC_GATT_DISC_ALL_PRIMARY_SERVICES:
      {
        APP_DBG_MSG("GATT services discovery\n");
        result = aci_gatt_clt_disc_all_primary_services(a_ClientContext[index].connHdl, BLE_GATT_UNENHANCED_ATT_L2CAP_CID);

        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
          APP_DBG_MSG("PROC_GATT_CTL_DISC_ALL_PRIMARY_SERVICES services discovered Successfully\n\n");
        }
        else
        {
          APP_DBG_MSG("PROC_GATT_CTL_DISC_ALL_PRIMARY_SERVICES aci_gatt_clt_disc_all_primary_services cmd NOK status =0x%02X\n\n", result);
        }
      }

      break; /* PROC_GATT_DISC_ALL_PRIMARY_SERVICES */

      case PROC_GATT_DISC_ALL_CHARS:
      {
        APP_DBG_MSG("DISCOVER_ALL_CHARS ConnHdl=0x%04X ALLServiceHandle[0x%04X - 0x%04X]\n",
                          a_ClientContext[index].connHdl,
                          0x0001,
                          0xFFFF);
        result = aci_gatt_clt_disc_all_char_of_service(
                           a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           0x0001,
                           0xFFFF);
        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
          APP_DBG_MSG("All characteristics discovered Successfully\n\n");
        }
        else
        {
          APP_DBG_MSG("All characteristics discovery Failed, status =0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_DISC_ALL_CHARS */

      case PROC_GATT_DISC_ALL_DESCS:
      {
        APP_DBG_MSG("DISCOVER_ALL_CHAR_DESCS [0x%04X - 0x%04X]\n",
                         0x0001,
                         0xFFFF);
        result = aci_gatt_clt_disc_all_char_desc(
                           a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           0x0001,
                           0xFFFF);
        if (result == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
          APP_DBG_MSG("All characteristic descriptors discovered Successfully\n\n");
        }
        else
        {
          APP_DBG_MSG("All characteristic descriptors discovery Failed, status =0x%02X\n\n", result);
        }
      }
      break; /* PROC_GATT_DISC_ALL_DESCS */
      case PROC_GATT_ENABLE_ALL_NOTIFICATIONS:
      {
        uint16_t enable; /* Buffer must be kept valid for aci_gatt_clt_write until a gatt procedure complete is received. */

