stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
        if (a_ClientContext[index].ServiceChangedCharDescHdl != 0x0000)
        {
          enable = 0x0002;
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].ServiceChangedCharDescHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
          APP_DBG_MSG(" ServiceChangedCharDescHdl =0x%04X\n",a_ClientContext[index].ServiceChangedCharDescHdl);
        }
        /* USER CODE BEGIN PROC_GATT_ENABLE_ALL_NOTIFICATIONS */
        if(a_ClientContext[index].ESLControlPointCCCDHdl != 0x0000)
        {
          enable = 0x0001;
          APP_DBG_MSG("Enable notifications on ECP (handle 0x%04X)\n", a_ClientContext[index].ESLControlPointCCCDHdl);
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].ESLControlPointCCCDHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
        }
        if(a_ClientContext[index].OTSHandles.ObjActionCPCCCDHdl != 0x0000)
        {
          enable = 0x0002;
          APP_DBG_MSG("Enable indications on OACP (handle 0x%04X)\n", a_ClientContext[index].OTSHandles.ObjActionCPCCCDHdl);
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].OTSHandles.ObjActionCPCCCDHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
        }
        if(a_ClientContext[index].OTSHandles.ObjListCPCCCDHdl != 0x0000)
        {
          enable = 0x0002;
          APP_DBG_MSG("Enable indications on OLCP (handle 0x%04X)\n", a_ClientContext[index].OTSHandles.ObjListCPCCCDHdl);
          result = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                                      BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                      a_ClientContext[index].OTSHandles.ObjListCPCCCDHdl,
                                      2,
                                      (uint8_t *) &enable);
          gatt_cmd_resp_wait();
        }
        /* USER CODE END PROC_GATT_ENABLE_ALL_NOTIFICATIONS */

        if ((result == BLE_STATUS_SUCCESS) && (a_ClientContext[0].gatt_error_code == 0))
        {
          APP_DBG_MSG("Notifications enabled successfully\n");
        }
        else
        {
          APP_DBG_MSG("Enabling notifications failed, status 0x%02X, gatt error code=0x%02X\n", result, a_ClientContext[0].gatt_error_code);
        }
        a_ClientContext[0].gatt_error_code = 0;
      }
      break; /* PROC_GATT_ENABLE_ALL_NOTIFICATIONS */
    default:
      break;
    }
  }

  return status;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static BLEEVT_EvtAckStatus_t EventHandler(aci_blecore_event *p_evt)
{
  BLEEVT_EvtAckStatus_t return_value = BLEEVT_NoAck;
  GATT_CLIENT_APP_Notification_evt_t Notification;
  UNUSED(Notification);

  return_value = BLEEVT_NoAck;

  switch (p_evt->ecode)
  {
    case ACI_ATT_CLT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_services((aci_att_clt_read_by_group_type_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE */
  case ACI_ATT_CLT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
    {
      aci_att_clt_find_by_type_value_resp_event_rp0 *p_evt_rsp = (void*) p_evt->data;
      gatt_parse_services_by_UUID((aci_att_clt_find_by_type_value_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE */
    case ACI_ATT_CLT_READ_BY_TYPE_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_by_type_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_chars((aci_att_clt_read_by_type_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE */
    case ACI_ATT_CLT_FIND_INFO_RESP_VSEVT_CODE:
    {
      aci_att_clt_find_info_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_descs((aci_att_clt_find_info_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_FIND_INFO_RESP_VSEVT_CODE */
    case ACI_GATT_CLT_NOTIFICATION_VSEVT_CODE:
    {
      aci_gatt_clt_notification_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_notification((aci_gatt_clt_notification_event_rp0 *)p_evt_rsp);
    }
    break;/* ACI_GATT_NOTIFICATION_VSEVT_CODE */
  case ACI_GATT_CLT_INDICATION_VSEVT_CODE:
    {
      aci_gatt_clt_indication_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      
      APP_DBG_MSG("ACI_GATT_CLT_INDICATION_VSEVT_CODE\n");
      if(p_evt_rsp->Attribute_Handle == a_ClientContext[0].ServiceChangedCharValueHdl)
      {
        APP_DBG_MSG("Service Changed Indication\n");
        
        GATT_CLIENT_APP_DiscoverServices(p_evt_rsp->Connection_Handle);
      }      
      else if(p_evt_rsp->Attribute_Handle == a_ClientContext[0].OTSHandles.ObjListCPValueHdl)
      {
        return_value = BLEEVT_Ack;
        
        OTP_CLIENT_OLCPIndication(p_evt_rsp->Attribute_Value, p_evt_rsp->Attribute_Value_Length);
      }
      else if(p_evt_rsp->Attribute_Handle == a_ClientContext[0].OTSHandles.ObjActionCPValueHdl)
      {
        return_value = BLEEVT_Ack;
        
        OTP_CLIENT_OACPIndication(p_evt_rsp->Attribute_Value, p_evt_rsp->Attribute_Value_Length);
      }
      
      aci_gatt_clt_confirm_indication(p_evt_rsp->Connection_Handle, p_evt_rsp->CID);
    }
    break;    
    case ACI_GATT_CLT_PROC_COMPLETE_VSEVT_CODE:
    {
      aci_gatt_clt_proc_complete_event_rp0 *p_evt_rsp = (void*)p_evt->data;

