stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
      uint8_t index = 0;
      
      gatt_cmd_resp_release();
      a_ClientContext[index].gatt_error_code = p_evt_rsp->Error_Code;
      APP_DBG_MSG("GATT procedure complete: 0x%02x\n", p_evt_rsp->Error_Code);
    }
    break;/* ACI_GATT_PROC_COMPLETE_VSEVT_CODE */
    case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
    {
      aci_gatt_tx_pool_available_event_rp0 *tx_pool_available;
      tx_pool_available = (aci_gatt_tx_pool_available_event_rp0 *)p_evt->data;
      UNUSED(tx_pool_available);
      /* USER CODE BEGIN ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */
      UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_TX_POOL_AVAILABLE_EVENT);
      /* USER CODE END ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */
    }
    break;/* ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE*/
    case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
    {
      aci_att_exchange_mtu_resp_event_rp0 * exchange_mtu_resp;
      exchange_mtu_resp = (aci_att_exchange_mtu_resp_event_rp0 *)p_evt->data;
      APP_DBG_MSG("  MTU exchanged size = %d\n",exchange_mtu_resp->MTU );
      a_ClientContext[0].att_mtu = exchange_mtu_resp->MTU;
      /* USER CODE BEGIN ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */

      /* USER CODE END ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
    }
    break;
    /* USER CODE BEGIN BLECORE_EVT */
    case ACI_GATT_CLT_ERROR_RESP_VSEVT_CODE:
    {  
      aci_gatt_clt_error_resp_event_rp0 * clt_error_resp;
      clt_error_resp = (aci_gatt_clt_error_resp_event_rp0 *)p_evt->data;
      APP_DBG_MSG("  GATT Error Response code: 0x%02x \n", clt_error_resp->Error_Code);
      UNUSED(clt_error_resp);
    }
    break; 
    
    case ACI_ATT_CLT_READ_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_resp_event_rp0 * clt_read_resp;
      clt_read_resp = (aci_att_clt_read_resp_event_rp0 *)p_evt->data;
      //APP_DBG_MSG("  GATT Read Response length: 0x%02x \n", clt_read_resp->Event_Data_Length);
      a_ClientContext[0].read_char_len = clt_read_resp->Event_Data_Length;
      memcpy(a_ClientContext[0].read_char, clt_read_resp->Attribute_Value, a_ClientContext[0].read_char_len);
      a_ClientContext[0].read_char_offset = a_ClientContext[0].read_char_len;
    }    
    break;
    
    case ACI_ATT_CLT_READ_BLOB_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_blob_resp_event_rp0 * clt_read_resp;
      clt_read_resp = (aci_att_clt_read_blob_resp_event_rp0 *)p_evt->data;
      APP_DBG_MSG("  GATT Read Blob Response length: 0x%02x \n", clt_read_resp->Event_Data_Length);
      a_ClientContext[0].read_char_len += clt_read_resp->Event_Data_Length;
      memcpy(a_ClientContext[0].read_char + a_ClientContext[0].read_char_offset, clt_read_resp->Attribute_Value, a_ClientContext[0].read_char_len);
      a_ClientContext[0].read_char_offset = a_ClientContext[0].read_char_len;
    }
    break;
    /* USER CODE END BLECORE_EVT */
    default:
      break;
  }/* end switch (p_evt->ecode) */

  return(return_value);
}

__USED static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif)
{
  /* USER CODE BEGIN gatt_Notification_1*/

  /* USER CODE END gatt_Notification_1 */
  switch (p_Notif->Client_Evt_Opcode)
  {
    /* USER CODE BEGIN Client_Evt_Opcode */
    case ESL_NOTIFICATION_INFO_RECEIVED_EVT:
      {
        //ECP notify: response of ESL to AT command sent writing the ECP
        ESL_AP_ECPNotificationReceived(p_Notif->DataTransfered.p_Payload); 
      }
      break;
    /* USER CODE END Client_Evt_Opcode */

    case NOTIFICATION_INFO_RECEIVED_EVT:
      /* USER CODE BEGIN NOTIFICATION_INFO_RECEIVED_EVT */

      /* USER CODE END NOTIFICATION_INFO_RECEIVED_EVT */
      break;

    default:
      /* USER CODE BEGIN Client_Evt_Opcode_Default */

      /* USER CODE END Client_Evt_Opcode_Default */
      break;
  }
  /* USER CODE BEGIN gatt_Notification_2*/

  /* USER CODE END gatt_Notification_2 */
  return;
}

/**
* function of GATT service parse
*/
static void gatt_parse_services(aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt)
{
  uint16_t uuid, ServiceStartHdl, ServiceEndHdl;
  uint8_t uuid_offset, uuid_size, uuid_short_offset;
  uint8_t i, idx, numServ, index;

//  APP_DBG_MSG("ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE - ConnHdl=0x%04X\n",
//                p_evt->Connection_Handle);

  for (index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  /* check connection handle related to response before processing */
  if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  {
    /* Number of attribute value tuples */
    numServ = (p_evt->Data_Length) / p_evt->Attribute_Data_Length;

    /* event data in Attribute_Data_List contains:
    * 2 bytes for start handle
    * 2 bytes for end handle
    * 2 or 16 bytes data for UUID
    */
    if (p_evt->Attribute_Data_Length == 20) /* we are interested in the UUID is 128 bit.*/
    {
      idx = 16;                /*UUID index of 2 bytes read part in Attribute_Data_List */
      uuid_offset = 4;         /*UUID offset in bytes in Attribute_Data_List */
      uuid_size = 16;          /*UUID size in bytes */
      uuid_short_offset = 12;  /*UUID offset of 2 bytes read part in UUID field*/
    }
    if (p_evt->Attribute_Data_Length == 6) /* we are interested in the UUID is 16 bit.*/
    {
      idx = 4;
      uuid_offset = 4;
      uuid_size = 2;
      uuid_short_offset = 0;
    }
    UNUSED(idx);
    UNUSED(uuid_size);

    /* Loop on number of attribute value tuples */
    for (i = 0; i < numServ; i++)
    {
      ServiceStartHdl =  UNPACK_2_BYTE_PARAMETER(&p_evt->Attribute_Data_List[uuid_offset - 4]);
      ServiceEndHdl = UNPACK_2_BYTE_PARAMETER(&p_evt->Attribute_Data_List[uuid_offset - 2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&p_evt->Attribute_Data_List[uuid_offset + uuid_short_offset]);
      APP_DBG_MSG("  %d/%d short UUID=0x%04X, handle [0x%04X - 0x%04X]",
                   i + 1, numServ, uuid, ServiceStartHdl,ServiceEndHdl);

      /* complete context fields */
      if ( (a_ClientContext[index].ALLServiceStartHdl == 0x0000) || (ServiceStartHdl < a_ClientContext[index].ALLServiceStartHdl) )
      {
        a_ClientContext[index].ALLServiceStartHdl = ServiceStartHdl;
      }
      if ( (a_ClientContext[index].ALLServiceEndHdl == 0x0000) || (ServiceEndHdl > a_ClientContext[index].ALLServiceEndHdl) )
      {
        a_ClientContext[index].ALLServiceEndHdl = ServiceEndHdl;
      }

      if (uuid == GAP_SERVICE_UUID)
      {
        a_ClientContext[index].GAPServiceStartHdl = ServiceStartHdl;
        a_ClientContext[index].GAPServiceEndHdl = ServiceEndHdl;

        APP_DBG_MSG(", GAP_SERVICE_UUID found\n");
      }
      else if (uuid == GATT_SERVICE_UUID)
      {
        a_ClientContext[index].GATTServiceStartHdl = ServiceStartHdl;
        a_ClientContext[index].GATTServiceEndHdl = ServiceEndHdl;

