stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
        APP_DBG_MSG(", GENERIC_ATTRIBUTE_SERVICE_UUID found\n");
      }
/* USER CODE BEGIN gatt_parse_services_1 */
      else if (uuid == ESL_SERVICE_UUID)
      {
        a_ClientContext[index].ESLServiceHdl = ServiceStartHdl;
        a_ClientContext[index].ESLServiceEndHdl = ServiceEndHdl;

        APP_DBG_MSG(", ESL_SERVICE_UUID found\n");
      }
      else if (uuid == DEVICE_INFORMATION_SERVICE_UUID)
      {
        APP_DBG_MSG(", Device Information Service found\n");
      }
/* USER CODE END gatt_parse_services_1 */
      else
      {
        APP_DBG_MSG("\n");
      }

      uuid_offset += p_evt->Attribute_Data_Length;
    }
  }
  else
  {
    APP_DBG_MSG("ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE, failed no free index in connection table !\n");
  }

  return;
}

/**
* function of GATT service parse by UUID
*/
static void gatt_parse_services_by_UUID(aci_att_clt_find_by_type_value_resp_event_rp0 *p_evt)
{
  uint8_t i;

  APP_DBG_MSG("ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE - ConnHdl=0x%04X, Num_of_Handle_Pair=%d\n",
                p_evt->Connection_Handle,
                p_evt->Num_of_Handle_Pair);

  for(i = 0 ; i < p_evt->Num_of_Handle_Pair ; i++)
  {
    APP_DBG_MSG("ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE - PaitId=%d Found_Attribute_Handle=0x%04X, Group_End_Handle=0x%04X\n",
                  i,
                  p_evt->Attribute_Group_Handle_Pair[i].Found_Attribute_Handle,
                  p_evt->Attribute_Group_Handle_Pair[i].Group_End_Handle);
  }

/* USER CODE BEGIN gatt_parse_services_by_UUID_1 */

/* USER CODE END gatt_parse_services_by_UUID_1 */

  return;
}

/**
* function of GATT characteristics parse
*/
static void gatt_parse_chars(aci_att_clt_read_by_type_resp_event_rp0 *p_evt)
{
  uint16_t uuid, CharStartHdl, CharValueHdl;
  uint8_t uuid_offset, uuid_size, uuid_short_offset;
  uint8_t i, idx, numHdlValuePair, index;
  uint8_t CharProperties;

//  APP_DBG_MSG("ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE - ConnHdl=0x%04X\n",
//                p_evt->Connection_Handle);

  for (index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  {
    /* event data in Attribute_Data_List contains:
    * 2 bytes for start handle
    * 1 byte char properties
    * 2 bytes handle
    * 2 or 16 bytes data for UUID
    */

    /* Number of attribute value tuples */
    numHdlValuePair = p_evt->Data_Length / p_evt->Handle_Value_Pair_Length;

    if (p_evt->Handle_Value_Pair_Length == 21) /* we are interested in  128 bit UUIDs */
    {
      idx = 17;                /* UUID index of 2 bytes read part in Attribute_Data_List */
      uuid_offset = 5;         /* UUID offset in bytes in Attribute_Data_List */
      uuid_size = 16;          /* UUID size in bytes */
      uuid_short_offset = 12;  /* UUID offset of 2 bytes read part in UUID field */
    }
    if (p_evt->Handle_Value_Pair_Length == 7) /* we are interested in  16 bit UUIDs */
    {
      idx = 5;
      uuid_offset = 5;
      uuid_size = 2;
      uuid_short_offset = 0;
    }
    UNUSED(idx);
    UNUSED(uuid_size);

    p_evt->Data_Length -= 1;

    //APP_DBG_MSG("  ConnHdl=0x%04X, number of value pair = %d\n", a_ClientContext[index].connHdl, numHdlValuePair);
    /* Loop on number of attribute value tuples */
    for (i = 0; i < numHdlValuePair; i++)
    {
      CharStartHdl = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_Value_Pair_Data[uuid_offset - 5]);
      CharProperties = p_evt->Handle_Value_Pair_Data[uuid_offset - 3];
      CharValueHdl = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_Value_Pair_Data[uuid_offset - 2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_Value_Pair_Data[uuid_offset + uuid_short_offset]);

      if ( (uuid != 0x0) && (CharProperties != 0x0) && (CharStartHdl != 0x0) && (CharValueHdl != 0) )
      {
        APP_DBG_MSG("    %d/%d short UUID=0x%04X, Properties=0x%04X, CharHandle [0x%04X - 0x%04X]",
                     i + 1, numHdlValuePair, uuid, CharProperties, CharStartHdl, CharValueHdl);

        if (uuid == DEVICE_NAME_UUID)
        {
          APP_DBG_MSG(", GAP DEVICE_NAME charac found\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
          APP_DBG_MSG(", GAP APPEARANCE charac found\n");
        }
        else if (uuid == SERVICE_CHANGED_UUID)
        {
          a_ClientContext[index].ServiceChangedCharHdl = CharStartHdl;
          a_ClientContext[index].ServiceChangedCharValueHdl = CharValueHdl;
          APP_DBG_MSG(", GATT SERVICE_CHANGED_CHARACTERISTIC_UUID charac found\n");
        }
/* USER CODE BEGIN gatt_parse_chars_1 */
#ifndef PTS_OTP
        else if (uuid == ESL_CONTROL_POINT_UUID)
        {
          a_ClientContext[index].ESLControlPointCharHdl = CharStartHdl;
          a_ClientContext[index].ESLControlPointValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_CONTROL_POINT_UUID charac found\n");
        }
        else if (uuid == ESL_ADDRESS_UUID)
        {
          a_ClientContext[index].ESLAddressCharHdl = CharStartHdl;
          a_ClientContext[index].ESLAddressValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_ADDRESS_UUID charac found\n");
        }
        else if (uuid == AP_SYNC_KEY_MATERIAL_UUID)
        {
          a_ClientContext[index].APSyncKeyMaterialCharHdl = CharStartHdl;
          a_ClientContext[index].APSyncKeyMaterialValueHdl = CharValueHdl;
          APP_DBG_MSG(", AP_SYNC_KEY_MATERIAL_UUID charac found\n");
        }       
        else if (uuid == ESL_RESP_KEY_MATERIAL_UUID)
        {
          a_ClientContext[index].ESLRespKeyMaterialCharHdl = CharStartHdl;
          a_ClientContext[index].ESLRespKeyMaterialValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_RESP_KEY_MATERIAL_UUID charac found\n");
        }
        else if (uuid == ESL_CURR_ABS_TIME_UUID)
        {
          a_ClientContext[index].ESLCurrAbsTimeCharHdl = CharStartHdl;
          a_ClientContext[index].ESLCurrAbsTimeValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_CURR_ABS_TIME_UUID charac found\n");
        }
        else if (uuid == ESL_DISPLAY_INFO_UUID)
        {
          a_ClientContext[index].ESLDisplayInfoCharHdl = CharStartHdl;
          a_ClientContext[index].ESLDisplayInfoValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_DISPLAY_INFO_UUID charac found\n");
        }
        else if (uuid == ESL_IMAGE_INFO_UUID)
        {
          a_ClientContext[index].ESLImageInfoCharHdl = CharStartHdl;
          a_ClientContext[index].ESLImageInfoValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_IMAGE_INFO_UUID charac found\n");
        }
        else if (uuid == ESL_SENSOR_INFO_UUID)
        {
          a_ClientContext[index].ESLSensorInfoCharHdl = CharStartHdl;
          a_ClientContext[index].ESLSensorInfoValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_SENSOR_INFO_UUID charac found\n");
        }
        else if (uuid == ESL_LED_INFO_UUID)
        {
          a_ClientContext[index].ESLLedInfoCharHdl = CharStartHdl;
          a_ClientContext[index].ESLLedInfoValueHdl = CharValueHdl;
          APP_DBG_MSG(", ESL_LED_INFO_UUID charac found\n");
        }
#endif
        else if (uuid == OTS_FEATURE_UUID)
        {
          a_ClientContext[index].OTSHandles.OTSFeatureValueHdl = CharValueHdl;
          APP_DBG_MSG(", OTS_FEATURE_UUID charac found\n");
        }
        else if (uuid == OBJECT_NAME_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjNameValueHdl = CharValueHdl;
          APP_DBG_MSG(", OBJECT_NAME_UUID charac found\n");
        }
        else if (uuid == OBJECT_TYPE_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjTypeValueHdl = CharValueHdl;
          APP_DBG_MSG(", OBJECT_TYPE_UUID charac found\n");
        }
        else if (uuid == OBJECT_SIZE_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjSizeValueHdl = CharValueHdl;
          APP_DBG_MSG(", OBJECT_SIZE_UUID charac found\n");
        }
        else if (uuid == OBJECT_LAST_MODIFIED_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjLastModifiedValueHdl = CharValueHdl;
          a_ClientContext[index].OTSHandles.ObjLastModifiedProp = CharProperties;
          APP_DBG_MSG(", OBJECT_LAST_MODIFIED_UUID charac found\n");
        }
        else if (uuid == OBJECT_ID_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjIdValueHdl = CharValueHdl;
          APP_DBG_MSG(", OBJECT_ID_UUID charac found\n");
        }
        else if (uuid == OBJECT_PROPERTIES_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjPropValueHdl = CharValueHdl;
          APP_DBG_MSG(", OBJECT_PROPERTIES_UUID charac found\n");
        }
        else if (uuid == OBJECT_ACTION_CONTROL_POINT_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjActionCPValueHdl = CharValueHdl;
          APP_DBG_MSG(", OBJECT_ACTION_CONTROL_POINT_UUID charac found\n");
        }
        else if (uuid == OBJECT_LIST_CONTROL_POINT_UUID)
        {
          a_ClientContext[index].OTSHandles.ObjListCPValueHdl = CharValueHdl;
          APP_DBG_MSG(", OBJECT_LIST_CONTROL_POINT_UUID charac found\n");
        }
        else if (uuid == OBJECT_LIST_FILTER_POINT_UUID)
        {
          for(uint8_t i = 0; i < 3; i++)
          {
            if(a_ClientContext[index].OTSHandles.ObjListFilterValueHdl[i] == 0)
            {
              a_ClientContext[index].OTSHandles.ObjListFilterValueHdl[i] = CharValueHdl;
              break;
            }
          }
          APP_DBG_MSG(", OBJECT_LIST_FILTER_POINT_UUID charac found\n");
        }
        else if (uuid == PNPID_UUID)
        {
          a_ClientContext[index].DISPNPIdCharHdl = CharStartHdl;
          a_ClientContext[index].DISPNPIdValueHdl = CharValueHdl;
          APP_DBG_MSG(", PNPID_UUID charac found\n");
        }
/* USER CODE END gatt_parse_chars_1 */
        else
        {
          APP_DBG_MSG("\n");
        }

