stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

/* If the AP establish a bond with an ESL and ESL is on Configuring state,
   the AP can configure ESL by writing some ESL Service characteristics  
   (called on ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE) */
uint8_t GATT_CLIENT_APP_ConfigureESL(void)
{
  uint8_t index = 0;
  uint8_t ret;
  esl_info_t *p_esl_info = &ESL_AP_Context.conn_esl_info;
  
  /* ESL Address characteristic */
  APP_DBG_MSG("Writing ESL Address (0x%04X)\n", p_esl_info->esl_address);
  ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           a_ClientContext[index].ESLAddressValueHdl,
                           2,
                           (uint8_t *)&p_esl_info->esl_address); 
  
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].ESLAddressValueHdl);
    return 1;
  }
  else
  {
    /* wait until a gatt procedure complete is received */
    gatt_cmd_resp_wait();
    
    if(a_ClientContext[0].gatt_error_code)
    {
      return 1;
    }
  }
  
  if(ESL_AP_Context.provisioning)
  {
    /* keys are written only during provisioning. We let write other characteristics
       even if we are just updating ESL.  */
  
    //AP Sync Material characteristic
    APP_DBG_MSG("Writing AP Sync Material\n");  
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                             a_ClientContext[index].APSyncKeyMaterialValueHdl,
                             24,
                             (uint8_t *)&ESL_AP_Context.ap_sync_key_material); 
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].APSyncKeyMaterialValueHdl);
      return 1;
    }
    else
    {
      /* wait until a gatt procedure complete is received */
      gatt_cmd_resp_wait();
      
      if(a_ClientContext[0].gatt_error_code)
      {
        return 1;
      }
    }
    
    //ESL Resp Key Material characteristic  
    ESL_AP_GenerateKeyMaterial(&p_esl_info->esl_resp_key_material);
    
    APP_DBG_MSG("Writing Response Key Material:\n");
    APP_DBG_MSG("Session key: ");
    for(int i = sizeof(p_esl_info->esl_resp_key_material.session_key); i >= 0; i--)
    {
      APP_DBG_MSG("%02X ", p_esl_info->esl_resp_key_material.session_key[i]);
    }
    APP_DBG_MSG("\nIV: ");
    for(int i = sizeof(p_esl_info->esl_resp_key_material.iv); i >= 0; i--)
    {
      APP_DBG_MSG("%02X ", p_esl_info->esl_resp_key_material.iv[i]);
    }
    APP_DBG_MSG("\n");
    
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                             a_ClientContext[index].ESLRespKeyMaterialValueHdl,
                             24,
                             (uint8_t *)&p_esl_info->esl_resp_key_material); //ESL Resp Key Material
    
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].ESLRespKeyMaterialValueHdl);
      return 1;
    }
    else
    {
      /* wait until a gatt procedure complete is received */
      gatt_cmd_resp_wait();
      
      if(a_ClientContext[0].gatt_error_code)
      {
        return 1;
      }
    }
  }
  
  /* ESL Current Absolute Time characteristic */  
  uint32_t absoluteTime = TIMEREF_GetCurrentAbsTime();
  APP_DBG_MSG("Writing Absolute time (%d)\n", absoluteTime);  
  ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           a_ClientContext[index].ESLCurrAbsTimeValueHdl,
                           4,
                           (uint8_t *)&absoluteTime);
  
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].ESLCurrAbsTimeValueHdl);
    return 1;
  }
  else
  {
    /* wait until a gatt procedure complete is received */
    gatt_cmd_resp_wait();
    
    if(a_ClientContext[0].gatt_error_code)
    {
      return 1;
    }
  }
  
  if(ESL_AP_Context.configuring)
  {
    ret = ESL_AP_CmdUpdateComplete();
    if(ret)
    {
      APP_DBG_MSG("Fail sending update complete command\n");
      return 2;
    }
  }
  
  ret = ESL_AP_StoreESLInfo(&ESL_AP_Context.conn_esl_info);
  if(ret == 0)
  {
    APP_DBG_MSG("ESL configuration saved\n");
  }
  else
  {
    APP_DBG_MSG("Error while saving configuration\n");
    aci_gap_terminate(a_ClientContext[0].connHdl, BLE_ERROR_TERMINATED_REMOTE_USER);
    
    return 2;
  }
  
  return 0;
}

/* If bResponse is true the command wait for an ESL response, else the 
   command has no response, so the timer ECP_TIMEOUT_MS must not start */
uint8_t GATT_CLIENT_APP_WriteECP(uint8_t* cmd, uint8_t len_cmd, bool bResponse)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  uint8_t index = 0;
  
  /* If an ECP procedure times out, then the AP shall not start a new ECP 
   procedure until a new link is established with the ESL.*/
  if(!a_ClientContext[index].b_ECP_failed)
  {    
    APP_DBG_MSG("Writing ECP\n");
    
    ret = aci_gatt_clt_write(a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           a_ClientContext[index].ESLControlPointValueHdl,
                           len_cmd,
                           cmd);
    
    if (ret != BLE_STATUS_SUCCESS)
    {  
      APP_DBG_MSG(" Failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  a_ClientContext[index].connHdl,
                  a_ClientContext[index].ESLControlPointValueHdl);
      return ret;
    }
    /* wait until a gatt procedure complete is received */
    gatt_cmd_resp_wait();
    
    if(a_ClientContext[index].gatt_error_code != 0)
    {
      APP_DBG_MSG(" Procedure failed with gatt_error_code = 0x%02X\n",
                  a_ClientContext[index].gatt_error_code);
      return a_ClientContext[index].gatt_error_code;
    }
   
    /* When the AP writes to the ECP, the AP shall start a timer with the value  
       set to the ESL Control Point Timeout period.*/
    if (bResponse)
      HAL_RADIO_TIMER_StartVirtualTimer(&a_ClientContext[index].ECP_timer_Id, ECP_TIMEOUT_MS);
  }  
  return ret;
}

static void ECPTimeout(void *arg)
{  
  APP_DBG_MSG("ECP procedure failed\n");
  /* If an ECP procedure times out, then the AP shall not start a new ECP 
     procedure until a new link is established with the ESL.*/
  set_ECP_Failed(true);
}

static void set_ECP_Failed(bool bValue)
{
  uint8_t index = 0;
  
  a_ClientContext[index].b_ECP_failed = bValue;
}

