stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/gatt_client_app.c
static void print_Info_Char(void)
{
  for (int i = 0; i < a_ClientContext[0].read_char_len; i++) 
  {
    APP_DBG_MSG("%02X", a_ClientContext[0].read_char[i]);
    if (i < a_ClientContext[0].read_char_len-1) 
      APP_DBG_MSG(":");
  }    
  APP_DBG_MSG("\n");
}

uint8_t GATT_CLIENT_APP_ReadAllInfo(void)
{
  tBleStatus ret = 0;
  
//  APP_DBG_MSG("ESL_AP_Read_Info_Chars!\n");
  
  APP_DBG_MSG("Read Display Information\n");
  GATT_CLIENT_APP_ReadDisplayInfo(); 
  
  APP_DBG_MSG("Read Image Information\n");
  GATT_CLIENT_APP_ReadImageInfo();
  
  APP_DBG_MSG("Read Sensor Information\n");
  GATT_CLIENT_APP_ReadSensorInfo();
  
  APP_DBG_MSG("Read LED Information\n");
  GATT_CLIENT_APP_ReadLedInfo();
  
  APP_DBG_MSG("Read PnP ID\n");
  GATT_CLIENT_APP_ReadPnPID();
  
  return ret;
}
  

uint8_t GATT_CLIENT_APP_ReadDisplayInfo(void)
{
  uint8_t index = 0;
  
  if(a_ClientContext[index].ESLDisplayInfoValueHdl == 0)
    return BLE_STATUS_ERROR;

  return ReadInfoChar(a_ClientContext[index].ESLDisplayInfoValueHdl); 
}

uint8_t GATT_CLIENT_APP_ReadImageInfo(void)
{
  uint8_t index = 0;
  
  if(a_ClientContext[index].ESLImageInfoValueHdl == 0)
    return BLE_STATUS_ERROR;

  return ReadInfoChar(a_ClientContext[index].ESLImageInfoValueHdl); 
}

uint8_t GATT_CLIENT_APP_ReadSensorInfo(void)
{
  uint8_t index = 0;
  
  if(a_ClientContext[index].ESLSensorInfoValueHdl == 0)
    return BLE_STATUS_ERROR;


  return ReadInfoChar(a_ClientContext[index].ESLSensorInfoValueHdl); 
}

uint8_t GATT_CLIENT_APP_ReadLedInfo(void)
{
  uint8_t index = 0;
  
  if(a_ClientContext[index].ESLLedInfoValueHdl == 0)
    return BLE_STATUS_ERROR;


  return ReadInfoChar(a_ClientContext[index].ESLLedInfoValueHdl); 
}

uint8_t GATT_CLIENT_APP_ReadPnPID(void)
{
  uint8_t index = 0;
  
  if(a_ClientContext[index].DISPNPIdValueHdl == 0)
    return BLE_STATUS_ERROR;


  return ReadInfoChar(a_ClientContext[index].DISPNPIdValueHdl); 
}

static uint8_t ReadInfoChar(uint16_t ValueHdl)
{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  //APP_DBG_MSG("ESL_AP_Read_Info_Chars!\n");
  
  a_ClientContext[index].read_char_offset = 0;

  /* Display Information characteristic */
  ret = aci_gatt_clt_read(a_ClientContext[index].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           ValueHdl); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_read failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                ValueHdl);
    return ret;
  }
  APP_DBG_MSG("aci_gatt_clt_read, connHdl=0x%04X, ValueHdl=0x%04X\n",
            a_ClientContext[index].connHdl,
            ValueHdl);
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();
  
  if (a_ClientContext[0].read_char_len >= (a_ClientContext[0].att_mtu - 1))
  {
    /* Display Information characteristic Read long */
    ret = ReadLongChar(ValueHdl, a_ClientContext[0].read_char_len);
  }  
  print_Info_Char();
  
  return ret;
}

static uint8_t ReadLongChar(uint16_t ValueHdl, uint16_t Offset)
{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  APP_DBG_MSG("Read Long\n");

  ret = aci_gatt_clt_read_long(a_ClientContext[index].connHdl,
                               BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                               ValueHdl,
                               Offset); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_read_long failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                ValueHdl);
    return ret;
  }
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();  
  APP_DBG_MSG("aci_gatt_clt_read_long, connHdl=0x%04X, ValueHdl=0x%04X\n",
              a_ClientContext[index].connHdl,
              ValueHdl);
  
  return a_ClientContext[0].gatt_error_code;  
}

tBleStatus GATT_CLIENT_APP_ReadChar(uint16_t ValueHdl, uint8_t **data_p, uint16_t *data_length_p)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  a_ClientContext[0].read_char_offset = 0;

  ret = aci_gatt_clt_read(a_ClientContext[0].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           ValueHdl); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_read failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[0].connHdl,
                ValueHdl);
    return ret;
  }
  APP_DBG_MSG("aci_gatt_clt_read, connHdl=0x%04X, ValueHdl=0x%04X\n",
            a_ClientContext[0].connHdl,
            ValueHdl);
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();
  
  if (a_ClientContext[0].read_char_len >= (a_ClientContext[0].att_mtu - 1))
  {
    ret = ReadLongChar(ValueHdl, a_ClientContext[0].read_char_len);
  }
  
  *data_p = a_ClientContext[0].read_char;
  *data_length_p = a_ClientContext[0].read_char_len;
  
  //TODO: check if ReadLongChar returned "Attribute Not Long".
  
  return ret;
}

tBleStatus GATT_CLIENT_APP_WriteChar(uint16_t ValueHdl, uint8_t *data, uint16_t data_length)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  a_ClientContext[0].gatt_error_code = 0;

  ret = aci_gatt_clt_write(a_ClientContext[0].connHdl,
                           BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                           ValueHdl,
                           data_length,
                           data); 

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gatt_clt_write failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[0].connHdl,
                ValueHdl);
    return ret;
  }
  APP_DBG_MSG("aci_gatt_clt_write, connHdl=0x%04X, ValueHdl=0x%04X\n",
            a_ClientContext[0].connHdl,
            ValueHdl);
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();
  
  return a_ClientContext[0].gatt_error_code;
}

/* USER CODE END LF */
